asvetliakov.vscode-neovim
esbenp.prettier-vscode
github.copilot
github.copilot-chat
jdinhlife.gruvbox
jonathanharty.gruvbox-material-icon-theme
joshmu.periscope
mgmcdermott.vscode-language-babel
mirko013.cpp-gruvbox
vscodevim.vim
xabikos.javascriptsnippets
